/****************************************Copyright (c)**************************************************
**                                杭州鑫高科技有限公司
**                                     
**                                
** 文   件   名: uid.h
** 最后修改日期: 2015/5/20 22:25:16
** 描        述: 
** 版	     本: V1.0
** 主  控  芯 片:  晶振频率: 
** IDE: 
**********************************************************************************************************/
#ifndef __UID_H
#define	__UID_H

 
void GetUID(uint8_t *uid);				//读取产品ID,返回12个字节的ID数据
uint32_t GetDeviceID(void);				//获取设备ID
void  GetMACAdress(uint8_t *mac);		//获取设备的MAC地址 
void PrintUID(void);					//打印UID信息	


#endif




	

	

	












