/*
*********************************************************************************************************
*
*	模块名称 : 数据观察点与跟踪(DWT)模块
*	文件名称 : bsp_dwt.c
*	版    本 : V1.1
*	说    明 : 在CM3，CM4中可以有3种跟踪源：ETM, ITM 和DWT，本驱动主要实现
*              DWT中的时钟周期（CYCCNT）计数功能，此功能非常重要，可以很方便的
*              计算程序执行的时钟周期个数。
*	修改记录 :
*		版本号   日期        作者     说明
*		V1.0    2013-11-08  armfly   正式发布
*		V1.1	2016-2-23 	SY		 增加函数，用于测试某个程序段执行时间（精确到1US）、
*									  	时钟次数(精确到1个时钟，但是可能由于系统进入中断，导致测试结果出现偏差的情况)
*									 对于计算时钟次数，使用__NOP()函数测试，得出结果为1个时钟，因此，结果是可靠的。
*
*	Copyright (C), 2013-2014, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "bsp.h"


/*
*********************************************************************************************************
*                                             寄存器
*********************************************************************************************************
*/

#define  DWT_CR      *(volatile unsigned int *)0xE0001000
#define  DEM_CR      *(volatile unsigned int *)0xE000EDFC
#define  DBGMCU_CR   *(volatile unsigned int *)0xE0042004

#define  DEM_CR_TRCENA                   (1 << 24)
#define  DWT_CR_CYCCNTENA                (1 <<  0)

/*
*********************************************************************************************************
*                                             静态全局变量
*********************************************************************************************************
*/
static uint32_t g_measureStart = 0;
static uint32_t g_measureStop = 0;

/*
*********************************************************************************************************
*	函 数 名: bsp_InitDWT
*	功能说明: 初始化DWT. 该函数被 bsp_Init() 调用。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitDWT(void)
{
	DEM_CR         |= (unsigned int)DEM_CR_TRCENA;   /* Enable Cortex-M4's DWT CYCCNT reg.  */
    DWT_CYCCNT      = (unsigned int)0u;
    DWT_CR         |= (unsigned int)DWT_CR_CYCCNTENA;
}

/*
*********************************************************************************************************
*	函 数 名: TS_TmrRd
*	功能说明: 读取时钟运行次数
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static uint32_t TS_TmrRd( void )
{
	uint32_t ts_tmr_cnts = 0;
	
	ts_tmr_cnts = DWT_CYCCNT;
	
	return (ts_tmr_cnts); 			
}

/*
*********************************************************************************************************
*	函 数 名: MeasureFunctionRunTimeStart
*	功能说明: 测量函数运行时间开始
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void MeasureFunctionRunTimeStart( void )
{
	g_measureStart = TS_TmrRd();
}

/*
*********************************************************************************************************
*	函 数 名: MeasureFunctionRunTimeStop
*	功能说明: 测量函数运行时间结束
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void MeasureFunctionRunTimeStop( void )
{
	g_measureStop = TS_TmrRd();
}

/*
*********************************************************************************************************
*	函 数 名: GetFunctionRunTimeUS
*	功能说明: 获取函数运行时间（单位：us）
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
uint32_t GetFunctionRunTimeUS( void )
{
	uint32_t dealtClock = (g_measureStop - g_measureStart);
	uint32_t runTimeUS = 0;
	uint32_t systemClock = BSP_CPU_ClkFreq();
	
	runTimeUS = dealtClock / (systemClock / 1000000);
	
	return runTimeUS;			
}

/*
*********************************************************************************************************
*	函 数 名: PrintFunctionRunTimeUS
*	功能说明: 打印函数运行时间
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void PrintFunctionRunTimeUS( void )
{
	uint32_t runTimeUS = 0;
	
	MeasureFunctionRunTimeStop();
	
	runTimeUS = GetFunctionRunTimeUS();
	
	printf("runTimeUS: %d\r\n",runTimeUS);		
}

/*
*********************************************************************************************************
*	函 数 名: PrintFunctionRunColokCnt
*	功能说明: 打印函数运行时钟个数
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void PrintFunctionRunColokCnt( void )
{
	uint32_t deltaClock = 0;
	const uint32_t DELTA = 45;	/* 根据仿真实测数据 */
	
	MeasureFunctionRunTimeStop();
	
	deltaClock = (g_measureStop - g_measureStart - DELTA);
	
	printf("runClock: %d\r\n",deltaClock);		
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
