/****************************************Copyright (c)**************************************************
**                               	杭州鑫高科技有限公司
**                                   
**                                 
** 文   件   名: uid.c
** 最后修改日期: 2015/5/20 16:42:05 
** 描        述: 
** 版	     本: V1.0
** 主  控  芯 片: STM32F1XX,STM32F4XX
** IDE:MDK 
**********************************************************************************************************/
#include "bsp.h"  
 
//#define		UID_DEBUG 
 
#ifdef	STM32F40_41xxx
#define	UID_ADDR		0x1FFF7A10
#else
#define	UID_ADDR		0x1FFFF7E8
#endif 
 
/*
*********************************************************************************************************
*	函 数 名: GetUID
*	功能说明: 获取stm32的UID，返回96位，一共12个字节。
*	形    参: 返回UID指针
*	返 回 值: 无
*********************************************************************************************************
*/
void GetUID(uint8_t *uid)
{
	uint32_t *id;
	id=(uint32_t *)&uid[0];
	*id=*(__IO uint32_t*)(UID_ADDR); 
	
	id=(uint32_t *)&uid[4];
	*id=*(__IO uint32_t*)(UID_ADDR+4);
	
	id=(uint32_t *)&uid[8];
	*id=*(__IO uint32_t*)(UID_ADDR+8);   
} 
  
 
  
/*
*********************************************************************************************************
*	函 数 名: GetDeviceID
*	功能说明: 获取设备ID。
*	形    参: 无
*	返 回 值: 设备ID值，32位   
*********************************************************************************************************
*/  
uint32_t GetDeviceID(void)
{
	uint32_t id;
	id=*(__IO uint32_t*)(UID_ADDR);
	id^=*(__IO uint32_t*)(UID_ADDR+4);
	id^=*(__IO uint32_t*)(UID_ADDR+8); 
	return id;
}   
  
#define		MAC0		0x00		
#define		MAC1		0x80	
#define		MAC2	 	0xE1
/*
*********************************************************************************************************
*	函 数 名: GetMACAdress
*	功能说明: 获取设备MAC地址。MAC地址前面三个地址是IEEE给ST公司分配的数据
*	形    参: 将MAC地址写入mac指针
*	返 回 值: 无
*********************************************************************************************************
*/
void  GetMACAdress(uint8_t *mac) 
{
	uint8_t uid[12];
	GetUID(uid); 
	mac[0]=MAC0;
	mac[1]=MAC1;
	mac[2]=MAC2;
	mac[3]=uid[0]^uid[3]^uid[6]^uid[9];
	mac[4]=uid[1]^uid[4]^uid[7]^uid[10];
	mac[5]=uid[2]^uid[5]^uid[8]^uid[11];
}   
  
  
/*
*********************************************************************************************************
*	函 数 名: PrintUID
*	功能说明: 串口打印UID信息
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void PrintUID(void)
{
	#ifdef	UID_DEBUG 
	uint8_t i;
	uint8_t uid[12];
	GetUID(uid);
	printf("UID =%X",uid[0]);
	for(i=1;i<12;i++)
	{
		printf("-%X",uid[i]);
	} 
	printf("H\r\n");
	#endif	
}  
  
  
  
   
/******************************* (C) COPYRIGHT 2015 Xingao Tech *****************END OF FILE****/
